/* eslint-disable no-param-reassign */
import { createSlice } from '@reduxjs/toolkit'
import type { PayloadAction } from '@reduxjs/toolkit'

export interface State {
    keyWords: Array<string>
    date: string
    duration: string
    participants: Array<string>
    summary: {
        originalText: string
        userText: string
    }
    quotes: Array<string>
}

const initialState: State = {
    // description,
    keyWords: [
        'художник',
        'искусство',
        'современное искусство',
        'хорошее искусство',
        'произведение искусства',
        'работа',
        'успех',
        'профессиональное образование',
        'продажа картин',
    ],
    date: '13.10.2019',
    duration: '20:13',
    participants: ['Интервьюер', 'Тимофей Смирнов'],
    summary: {
        originalText:
            'Искусствовед и художник Тимофей Смирнов утверждает, что в любой профессии требуется образование, включая художников. Он считает, что хорошее искусство задает вопросы зрителю, а не отвечает на них, и должно сочетать в себе интеллектуальные, эстетические и актуальные компоненты. Он не стремится быть понятным для всех, скорее обращается к достаточно подготовленной аудитории. Интернет и доступность информации позволили людям расслабиться и иметь иллюзию знаний. Доступность произведений искусства привлекает широкий спектр покупателей, однако большинству нет денег на покупку. Цена на произведения искусства формируется на основе контекста, пути автора и других факторов. В России мало спроса на работы современных художников, но тенденция к изменению этой ситуации есть. Для изменения ситуации нужна государственная поддержка, налоговые льготы для коллекций искусства, образовательная реформа и усилия самих художников.',
        userText:
            'Искусствовед и художник Тимофей Смирнов утверждает, что в любой профессии требуется образование, включая художников. Он считает, что хорошее искусство задает вопросы зрителю, а не отвечает на них, и должно сочетать в себе интеллектуальные, эстетические и актуальные компоненты. Он не стремится быть понятным для всех, скорее обращается к достаточно подготовленной аудитории. Интернет и доступность информации позволили людям расслабиться и иметь иллюзию знаний. Доступность произведений искусства привлекает широкий спектр покупателей, однако большинству нет денег на покупку. Цена на произведения искусства формируется на основе контекста, пути автора и других факторов. В России мало спроса на работы современных художников, но тенденция к изменению этой ситуации есть. Для изменения ситуации нужна государственная поддержка, налоговые льготы для коллекций искусства, образовательная реформа и усилия самих художников.',
    },
    quotes: [
        'Искусство «ставит вопросы» — то есть побуждает зрителя к разговору, заставляет его думать, сопереживать и играть в те интеллектуальные игры, которые предлагает автор.',
        'И в этом смысле хорошее искусство — то, которое сочетает в себе три компонента. Первый — оно задействует интеллектуальные ресурсы зрителя. Второй — оно обладает высочайшими эстетическими свойствами. Музеи прочие институции демонстрируют, к какому уровню следует стремиться.',
        'Для меня успех — это успеть. С каждой секундой времени жизни все меньше, а ты должен успеть сказать все, что ты должен сказать.',
    ],
}

export const meetingSlice = createSlice({
    name: 'meeting',
    initialState,
    reducers: {
        setKeyWords: (state, action: PayloadAction<Array<string>>) => {
            state.keyWords = action.payload
        },
        setDate: (state, action: PayloadAction<string>) => {
            state.date = action.payload
        },
        setSummary: (state, action: PayloadAction<string>) => {
            state.summary.userText = action.payload
        },
    },
})

export const { setKeyWords, setDate, setSummary } = meetingSlice.actions

export default meetingSlice.reducer
